Deadline039/STM32-Template/freertos_h7xx/User/Application/Inc/stm32h7xx_hal_conf.h
/**
  ******************************************************************************
  * @file    stm32h7xx_hal_conf.h
  * @author  MCD Application Team
  * @brief   HAL configuration file.
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2017 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under BSD 3-Clause license,
  * the "License"; You may not use this file except in compliance with the
  * License. You may obtain a copy of the License at:
  *                        opensource.org/licenses/BSD-3-Clause
  *
  ******************************************************************************
  */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef STM32H7xx_HAL_CONF_H
#define STM32H7xx_HAL_CONF_H

#ifdef __cplusplus
extern "C" {
#endif

/* Exported types ------------------------------------------------------------*/
/* Exported constants --------------------------------------------------------*/

//-------- <<< Use Configuration Wizard in Context Menu >>> --------------------

/* ########################## Module Selection ############################## */

#define HAL_MODULE_ENABLED
#define HAL_CORTEX_MODULE_ENABLED

// <h> HAL 库配置选择

// <c> 启用 ADC (Analog-to-digital convert)
#define HAL_ADC_MODULE_ENABLED
// </c>

// <c> 启用 CEC (Consumer electronic controller)
#define HAL_CEC_MODULE_ENABLED
// </c>

// <c> 启用 Comp (Comparator)
#define HAL_COMP_MODULE_ENABLED
// </c>

// <c> 启用 CORDIC (Trigonometric calculation unit)
#define HAL_CORDIC_MODULE_ENABLED
// </c>

// <c> 启用 CRC (CRC calculation unit)
#define HAL_CRC_MODULE_ENABLED
// </c>

// <c> 启用 CRYP (Cryptographic processor)
#define HAL_CRYP_MODULE_ENABLED
// </c>

// <c> 启用 DAC (Digital to analog converter)
#define HAL_DAC_MODULE_ENABLED
// </c>

// <c> 启用 DCMI (Digital camera interface)
#define HAL_DCMI_MODULE_ENABLED
// </c>

// <c> 启用 DFSDM (Digital filter sigma delta modulator)
#define HAL_DFSDM_MODULE_ENABLED
// </c>

// <c> 启用 DMA (Digital filter sigma delta modulator)
#define HAL_DMA_MODULE_ENABLED
// </c>

// <c> 启用 DMA2D
#define HAL_DMA2D_MODULE_ENABLED
// </c>

// <c> 启用 DTS (Digital temperature sensor)
#define HAL_DTS_MODULE_ENABLED
// </c>

// <c> 启用 DSI (Display serial interface)
#define HAL_DSI_MODULE_ENABLED
// </c>

// <c> 启用 ETH (Ethernet controller)
#define HAL_ETH_MODULE_ENABLED
// </c>

// <c> 启用旧版 ETH (Ethernet controller)
// #define HAL_ETH_LEGACY_MODULE_ENABLED
// </c>

// <c> 启用 EXTI (External interrupt/event controller)
#define HAL_EXTI_MODULE_ENABLED
// </c>

// <c> 启用 FDCAN (Flexible data-rate controller area network unit)
#define HAL_FDCAN_MODULE_ENABLED
// </c>

// <c> 启用 FLASH (Flash memory)
#define HAL_FLASH_MODULE_ENABLED
// </c>

// <c> 启用 GFXMMU (Chrom-GRC)
#define HAL_GFXMMU_MODULE_ENABLED
// </c>

// <c> 启用 FMAC (Filtering mathematical calculation unit)
#define HAL_FMAC_MODULE_ENABLED
// </c>

// <c> 启用 GPIO (General purpose I/Os)
#define HAL_GPIO_MODULE_ENABLED
// </c>

// <c> 启用 HASH (Hash processor)
#define HAL_HASH_MODULE_ENABLED
// </c>

// <c> 启用 HCD (USB host controller driver)
#define HAL_HCD_MODULE_ENABLED
// </c>

// <c> 启用 HRTIM (High-resolution timer)
#define HAL_HRTIM_MODULE_ENABLED
// </c>

// <c> 启用 HSEM (Hardware semaphore)
#define HAL_HSEM_MODULE_ENABLED
// </c>

// <c> 启用 I2C (Inter-integrated circuit)
#define HAL_I2C_MODULE_ENABLED
// </c>

// <c> 启用 I2S (Inter-integrated sound)
#define HAL_I2S_MODULE_ENABLED
// </c>

// <c> 启用 IRDA (Infrared data association)
#define HAL_IRDA_MODULE_ENABLED
// </c>

// <c> 启用 IWDG (Independent watchdog)
#define HAL_IWDG_MODULE_ENABLED
// </c>

// <c> 启用 JPEG (Joint photographic experts group)
#define HAL_JPEG_MODULE_ENABLED
// </c>

// <c> 启用 LPTIM (Low-power timer)
#define HAL_LPTIM_MODULE_ENABLED
// </c>

// <c> 启用 LTDC (LCD TFT display controller)
#define HAL_LTDC_MODULE_ENABLED
// </c>

// <c> 启用 MDIOS (Management data input/output (MDIO) slave)
#define HAL_MDIOS_MODULE_ENABLED
// </c>

// <c> 启用 MDMA (Master direct memory access)
#define HAL_MDMA_MODULE_ENABLED
// </c>

// <c> 启用 MMC (MultiMediaCard)
#define HAL_MMC_MODULE_ENABLED
// </c>

// <c> 启用 NAND (NAND Flash memory)
#define HAL_NAND_MODULE_ENABLED
// </c>

// <c> 启用 NOR (NOR Flash memory)
#define HAL_NOR_MODULE_ENABLED
// </c>

// <c> 启用 OPAMP (Operational amplifier)
#define HAL_OPAMP_MODULE_ENABLED
// </c>

// <c> 启用 OSPI (Octo-SPI interface)
#define HAL_OSPI_MODULE_ENABLED
// </c>

// <c> 启用 OTFDEC (On-the-fly decryption engine)
#define HAL_OTFDEC_MODULE_ENABLED
// </c>

// <c> 启用 PCD (USB peripheral controller driver)
#define HAL_PCD_MODULE_ENABLED
// </c>

// <c> 启用 PWR (Power controller)
#define HAL_PWR_MODULE_ENABLED
// </c>

// <c> 启用 PSSI (Parallel synchronous slave interface)
#define HAL_PSSI_MODULE_ENABLED
// </c>

// <c> 启用 QSPI (Quad-SPI Flash memory)
#define HAL_QSPI_MODULE_ENABLED
// </c>

// <c> 启用 RAMECC (RAM ECC monitoring)
#define HAL_RAMECC_MODULE_ENABLED
// </c>

// <c> 启用 RCC (Reset and clock controller)
#define HAL_RCC_MODULE_ENABLED
// </c>

// <c> 启用 RNG (Random number generator)
#define HAL_RNG_MODULE_ENABLED
// </c>

// <c> 启用 RTC (Real-time clock)
#define HAL_RTC_MODULE_ENABLED
// </c>

// <c> 启用 SAI (Serial audio interface)
#define HAL_SAI_MODULE_ENABLED
// </c>

// <c> 启用 SD (Secure digital)
#define HAL_SD_MODULE_ENABLED
// </c>

// <c> 启用 SDIO (Secure Digital Input Output)
#define HAL_SDIO_MODULE_ENABLED

// <c> 启用 SDRAM (Synchronous dynamic RAM)
#define HAL_SDRAM_MODULE_ENABLED
// </c>

// <c> 启用 SMARTCARD (Smartcard IC)
#define HAL_SMARTCARD_MODULE_ENABLED
// </c>

// <c> 启用 SMBUS (System management bus)
#define HAL_SMBUS_MODULE_ENABLED
// </c>

// <c> 启用 SPDIFRX (SPDIF-RX Receiver interface)
#define HAL_SPDIFRX_MODULE_ENABLED
// </c>

// <c> 启用 SPI (Serial peripheral interface)
#define HAL_SPI_MODULE_ENABLED
// </c>

// <c> 启用 SRAM (SRAM external memory)
#define HAL_SRAM_MODULE_ENABLED
// </c>

// <c> 启用 SWPMI (Serial wire protocol master interface)
#define HAL_SWPMI_MODULE_ENABLED
// </c>

