Deadline039/STM32-Template/freertos_h7xx/User/Application/Inc/stm32h7xx_hal_conf.h
// <c> 启用 TIM (Advanced-control, general-purpose or basic timer)
#define HAL_TIM_MODULE_ENABLED
// </c>

// <c> 启用 UART (Universal asynchronous receiver/transmitter)
#define HAL_UART_MODULE_ENABLED
// </c>

// <c> 启用 USART (Universal synchronous receiver/transmitter)
#define HAL_USART_MODULE_ENABLED
// </c>

// <c> 启用 WWDG (Window watchdog)
#define HAL_WWDG_MODULE_ENABLED
// </c>

// </h>

/* ########################## Oscillator Values adaptation ####################*/

// <h> 时钟设置
#if !defined(HSE_VALUE)
// <o> HSE (外部高频振荡器) 频率 单位: Hz
#define HSE_VALUE 25000000UL
#endif /* HSE_VALUE */

#if !defined(HSE_STARTUP_TIMEOUT)
// <o> HSE 启动超时时间 单位: ms
#define HSE_STARTUP_TIMEOUT 100UL
#endif /* HSE_STARTUP_TIMEOUT */

/**
  * @brief Internal  oscillator (CSI) default value.
  *        This value is the default CSI value after Reset.
  */
#if !defined(CSI_VALUE)
// <o> CSI (内部晶振振荡器) 频率 单位: Hz
#define CSI_VALUE 4000000UL
#endif /* CSI_VALUE */

#if !defined(HSI_VALUE)
// <o> HSI (内部高频振荡器) 频率 单位: Hz
#define HSI_VALUE 64000000UL
#endif /* HSI_VALUE */

#if !defined(LSE_VALUE)
// <o> LSE (外部低速振荡器) 频率 单位: Hz
#define LSE_VALUE 32768UL
#endif /* LSE_VALUE */

#if !defined(LSE_STARTUP_TIMEOUT)
// <o> LSE 启动超时时间 单位: ms
#define LSE_STARTUP_TIMEOUT 5000UL
#endif /* LSE_STARTUP_TIMEOUT */

#if !defined(LSI_VALUE)
// <o> LSI (内部低速振荡器) 典型频率 单位: Hz
//  <i> LSI 受温度与电压影响很大
#define LSI_VALUE 32000UL
#endif /* LSI_VALUE */

#if !defined(EXTERNAL_CLOCK_VALUE)
// <o> 外部 I2S 时钟源频率
//  <i> I2S 计算时钟源的频率, 通过 I2S_CKIN 输入
#define EXTERNAL_CLOCK_VALUE 12288000UL
#endif /* EXTERNAL_CLOCK_VALUE */

// </h>

/* Tip: To avoid modifying this file each time you need to use different HSE,
   ===  you can define the HSE value in your toolchain compiler preprocessor. */

/* ########################### System Configuration ######################### */

// <h> 系统配置

// <o> VDD 供电电压 单位: mV
#define VDD_VALUE                            3300UL
// <o> SysTick 中断优先级
#define TICK_INT_PRIORITY                    15UL
// <q> 启用 RTOS (此宏不要启用, ST 预留接口)
#define USE_RTOS                             0
// <q> 启用 SD 收发
#define USE_SD_TRANSCEIVER                   0U
// <q> 启用 SPI CRC 校验
#define USE_SPI_CRC                          1U
// <q> 启用 Flash ECC
#define USE_FLASH_ECC                        0U
// <q> 启用 SDIO 收发
#define USE_SDIO_TRANSCEIVER                 0U
// <o> SDIO 最大 IO 数量
#define SDIO_MAX_IO_NUMBER                   7U

// </h>

// <h> 中断回调配置

//  <q> 启用 ADC (Analog-to-digital convert) 中断注册回调函数
#define USE_HAL_ADC_REGISTER_CALLBACKS       0
//  <q> 启用 CEC (Consumer electronic controller) 中断注册回调函数
#define USE_HAL_CEC_REGISTER_CALLBACKS       0
//  <q> 启用 Comp (Comparator) 中断注册回调函数
#define USE_HAL_COMP_REGISTER_CALLBACKS      0
//  <q> 启用 CORDIC (Trigonometric calculation unit) 中断注册回调函数
#define USE_HAL_CORDIC_REGISTER_CALLBACKS    0
//  <q> 启用 CRYP (Cryptographic processor) 中断注册回调函数
#define USE_HAL_CRYP_REGISTER_CALLBACKS      0
//  <q> 启用 DAC (Digital to analog converter) 中断注册回调函数
#define USE_HAL_DAC_REGISTER_CALLBACKS       0
//  <q> 启用 DCMI (Digital camera interface) 中断注册回调函数
#define USE_HAL_DCMI_REGISTER_CALLBACKS      0
//  <q> 启用 DFSDM (Digital filter sigma delta modulator) 中断注册回调函数
#define USE_HAL_DFSDM_REGISTER_CALLBACKS     0
//  <q> 启用 DMA2D 中断注册回调函数
#define USE_HAL_DMA2D_REGISTER_CALLBACKS     0
//  <q> 启用 DSI (Display serial interface) 中断注册回调函数
#define USE_HAL_DSI_REGISTER_CALLBACKS       0
//  <q> 启用 DTS (Digital temperature sensor) 中断注册回调函数
#define USE_HAL_DTS_REGISTER_CALLBACKS       0
//  <q> 启用 ETH (Ethernet controller) 中断注册回调函数
#define USE_HAL_ETH_REGISTER_CALLBACKS       0
//  <q> 启用 FDCAN (Flexible data-rate controller area network unit) 中断注册回调函数
#define USE_HAL_FDCAN_REGISTER_CALLBACKS     0
//  <q> 启用 FMAC (Filtering mathematical calculation unit) 中断注册回调函数
#define USE_HAL_FMAC_REGISTER_CALLBACKS      0
//  <q> 启用 NAND Flash 中断注册回调函数
#define USE_HAL_NAND_REGISTER_CALLBACKS      0
//  <q> 启用 Nor Flash 中断注册回调函数
#define USE_HAL_NOR_REGISTER_CALLBACKS       0
//  <q> 启用 SDRAM (Synchronous dynamic RAM) 中断注册回调函数
#define USE_HAL_SDRAM_REGISTER_CALLBACKS     0
//  <q> 启用 SRAM (SRAM external memory) 中断注册回调函数
#define USE_HAL_SRAM_REGISTER_CALLBACKS      0
//  <q> 启用 HASH (Hash processor) 中断注册回调函数
#define USE_HAL_HASH_REGISTER_CALLBACKS      0
//  <q> 启用 HCD (USB host controller driver) 中断注册回调函数
#define USE_HAL_HCD_REGISTER_CALLBACKS       0
//  <q> 启用 GFXMMU (Chrom-GRC) 中断注册回调函数
#define USE_HAL_GFXMMU_REGISTER_CALLBACKS    0
//  <q> 启用 HRTIM (High-resolution timer) 中断注册回调函数
#define USE_HAL_HRTIM_REGISTER_CALLBACKS     0
//  <q> 启用 I2C (Inter-integrated circuit) 中断注册回调函数
#define USE_HAL_I2C_REGISTER_CALLBACKS       0
//  <q> 启用 I2S (Inter-integrated sound) 中断注册回调函数
#define USE_HAL_I2S_REGISTER_CALLBACKS       0
//  <q> 启用 IRDA (Infrared data association) 中断注册回调函数
#define USE_HAL_IRDA_REGISTER_CALLBACKS      0
//  <q> 启用 JPEG (Joint photographic experts group) 中断注册回调函数
#define USE_HAL_JPEG_REGISTER_CALLBACKS      0
//  <q> 启用 LPTIM (Low-power timer) 中断注册回调函数
#define USE_HAL_LPTIM_REGISTER_CALLBACKS     0
//  <q> 启用 LTDC (LCD TFT display controller) 中断注册回调函数
#define USE_HAL_LTDC_REGISTER_CALLBACKS      0
//  <q> 启用 MDIOS (Management data input/output (MDIO) slave) 中断注册回调函数
#define USE_HAL_MDIOS_REGISTER_CALLBACKS     0
//  <q> 启用 MMC (MultiMediaCard) 中断注册回调函数
#define USE_HAL_MMC_REGISTER_CALLBACKS       0
//  <q> 启用 OPAMP (Operational amplifier) 中断注册回调函数
#define USE_HAL_OPAMP_REGISTER_CALLBACKS     0
//  <q> 启用 OSPI (Octo-SPI interface) 中断注册回调函数
#define USE_HAL_OSPI_REGISTER_CALLBACKS      0
//  <q> 启用 OTFDEC (On-the-fly decryption engine) 中断注册回调函数
#define USE_HAL_OTFDEC_REGISTER_CALLBACKS    0
//  <q> 启用 PCD (USB peripheral controller driver) 中断注册回调函数
#define USE_HAL_PCD_REGISTER_CALLBACKS       0
//  <q> 启用 QSPI (Quad-SPI Flash memory) 中断注册回调函数
#define USE_HAL_QSPI_REGISTER_CALLBACKS      0
//  <q> 启用 RNG (Random number generator) 中断注册回调函数
#define USE_HAL_RNG_REGISTER_CALLBACKS       0
//  <q> 启用 RTC (Real-time clock) 中断注册回调函数
#define USE_HAL_RTC_REGISTER_CALLBACKS       0
//  <q> 启用 SAI (Serial audio interface) 中断注册回调函数
#define USE_HAL_SAI_REGISTER_CALLBACKS       0
//  <q> 启用 SD (Secure digital) 中断注册回调函数
#define USE_HAL_SD_REGISTER_CALLBACKS        0
//  <q> 启用 SDIO (Secure Digital Input Output) 中断注册回调函数
#define USE_HAL_SDIO_REGISTER_CALLBACKS      0
//  <q> 启用 SMARTCARD (Smartcard IC) 中断注册回调函数
#define USE_HAL_SMARTCARD_REGISTER_CALLBACKS 0
//  <q> 启用 SPDIFRX (SPDIF-RX Receiver interface) 中断注册回调函数
#define USE_HAL_SPDIFRX_REGISTER_CALLBACKS   0
//  <q> 启用 SMBUS (System management bus) 中断注册回调函数
#define USE_HAL_SMBUS_REGISTER_CALLBACKS     0
//  <q> 启用 SPI (Serial peripheral interface) 中断注册回调函数
#define USE_HAL_SPI_REGISTER_CALLBACKS       0
//  <q> 启用 SWPMI (Serial wire protocol master interface) 中断注册回调函数
#define USE_HAL_SWPMI_REGISTER_CALLBACKS     0
//  <q> 启用 TIM (Advanced-control, general-purpose or basic timer) 中断注册回调函数
#define USE_HAL_TIM_REGISTER_CALLBACKS       0
//  <q> 启用 UART (Universal asynchronous receiver/transmitter) 中断注册回调函数
#define USE_HAL_UART_REGISTER_CALLBACKS      0
//  <q> 启用 USART (Universal synchronous receiver/transmitter) 中断注册回调函数
#define USE_HAL_USART_REGISTER_CALLBACKS     0
//  <q> 启用 WWDG (Window watchdog) 中断注册回调函数
#define USE_HAL_WWDG_REGISTER_CALLBACKS      0

